In [3]:
# Importing pandas
# Importing numpy

import pandas as pd
import numpy as np

# SELECTING
### For selecting columns or for filtering columns

----

There are two type of data structure in pandas

Series:
1 dimensional data structure with index

Pandas:
2 dimensional data structure. We mostly deal with them in pandas.

In [4]:
# Extracting data from three different .csv sources

# Here we read employees.csv file and store in emp as a dataframe
emp = pd.read_csv('/home/sage_gaurab/chained/code_world/ds_py/data_src/employees.csv')

# Here we read departments.csv file and store in dept as a dataframe
dept = pd.read_csv('/home/sage_gaurab/chained/code_world/ds_py/data_src/departments.csv')

# Here we read bonus.csv file and store in bonus as a dataframe
bonus = pd.read_csv('/home/sage_gaurab/chained/code_world/ds_py/data_src/bonus.csv')

In [5]:
# using method sample to get certain number of rows for analysing what type of data we are dealing with
emp.sample(0)

Empty DataFrame
Columns: [employee_id, first_name, last_name, department_id, salary, hire_date, city, performance_score]
Index: []

In [6]:
# Here i am selecting 3 fields of employees DataFrame with random three rows

emp[['employee_id', 'first_name', 'last_name']].sample(3)

    employee_id first_name last_name
15           16   Isabella    Garcia
0             1       John       Doe
17           18  Charlotte  Robinson

In [7]:
# Renaming field / column name in pandas 

emp['salary'].rename('monthly_salary').sample()

3    80000.0
Name: monthly_salary, dtype: float64

In [8]:
emp.sample()

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score
7,8,Sophia,Taylor,10,62000.0,2020-08-30,Dallas,91

In [9]:
bonus.sample()

   employee_id  bonus_amount  bonus_date
1            2          8000  2023-01-01

Select only employee_id, department_id, performance_score
Create a column experience_years = 2025 - YEAR(hire_date)
Select full name as "Full Name" = first_name || ' ' || last_name

In [10]:
# Select only employee_id, department_id, performance_score

emp[['employee_id', 'department_id', 'performance_score']].sample(3)

    employee_id  department_id  performance_score
5             6             20                 90
18           19             30                 86
14           15             40                 75

In [11]:
# x.to_datetime takes the field and converts its datatype
# If field is not already datetime datatype

emp['hire_date'] = pd.to_datetime(emp['hire_date'])
bonus['bonus_amount'] = pd.to_datetime(bonus['bonus_amount'])

In [12]:

# creating new column hire_year after extracting year from hire_date field

emp['hire_year'] = emp['hire_date'].dt.year
emp['hire_month'] = emp['hire_date'].dt.month
emp['hire_quarter'] = emp['hire_date'].dt.quarter

In [13]:
emp[['first_name','hire_date','hire_year','hire_quarter', 'hire_month']].head(5)

  first_name  hire_date  hire_year  hire_quarter  hire_month
0       John 2020-01-15       2020             1           1
1       Jane 2020-02-20       2020             1           2
2       Mike 2020-03-10       2020             1           3
3      Emily 2020-04-05       2020             2           4
4      David 2020-05-12       2020             2           5

In [14]:
# Creating field for current exact date
# emp['current_date'] = pd.Timestamp.now().date

In [15]:
# emp['current_date'].sample(3)

In [16]:
# Create a column experience_years = 2025 - YEAR(hire_date)
emp['experience_years'] = 2025 - emp['hire_year']

In [17]:
emp[['first_name','experience_years']].sample(5)

   first_name  experience_years
3       Emily                 5
18     Joseph                 4
13        Ava                 4
16    Matthew                 4
6      Robert                 5

In [18]:
# Select full name as "Full Name" = first_name || ' ' || last_name
# Here we are using + operator to concatinate and x.fillna('') to fill if the value is null
# .fillna() handels the null values in the fields columns

emp['Full Name'] = emp['first_name'] + ' ' + emp['last_name'].fillna('n/a')

In [19]:
emp[['Full Name','salary']].head(5)

      Full Name   salary
0      John Doe  60000.0
1    Jane Smith  75000.0
2  Mike Johnson  65000.0
3   Emily Brown  80000.0
4   David Davis      NaN

### Drop field

In [20]:
# emp = emp.drop(['hire_quarter', 'hire_month'], axis = 1)

# WHERE 
### For filtering data(Rows)

----

In [21]:
emp[(emp['salary']  > 70000) | (emp['department_id'] == 20)]

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name
1,2,Jane,Smith,20,75000.0,2020-02-20,Los Angeles,92,2020,2,1,5,Jane Smith
3,4,Emily,Brown,30,80000.0,2020-04-05,Houston,95,2020,4,2,5,Emily Brown
5,6,Laura,Wilson,20,72000.0,2020-06-18,Philadelphia,90,2020,6,2,5,Laura Wilson
6,7,Robert,Moore,30,85000.0,2020-07-22,San Antonio,79,2020,7,3,5,Robert Moore
9,10,Olivia,Thomas,20,78000.0,2020-10-15,Austin,96,2020,10,4,5,Olivia Thomas
11,12,Emma,White,30,82000.0,2021-02-15,Denver,89,2021,2,1,4,Emma White
12,13,Michael,Harris,20,74000.0,2021-03-20,Miami,87,2021,3,1,4,Michael Harris
17,18,Charlotte,Robinson,20,76000.0,2021-08-25,Orlando,94,2021,8,3,4,Charlotte Robinson
18,19,Joseph,Clark,30,83000.0,2021-09-30,Detroit,86,2021,9,3,4,Joseph Clark

In [22]:
emp['first_name'].str.startswith('M') # This returns me boolen values
emp[(emp['first_name'].str.startswith('M'))]

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name
2,3,Mike,Johnson,10,65000.0,2020-03-10,Chicago,78,2020,3,1,5,Mike Johnson
12,13,Michael,Harris,20,74000.0,2021-03-20,Miami,87,2021,3,1,4,Michael Harris
16,17,Matthew,Martinez,10,64000.0,2021-07-20,Las Vegas,81,2021,7,3,4,Matthew Martinez

In [23]:
emp[(emp['last_name'].str.endswith('n'))]

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name
2,3,Mike,Johnson,10,65000.0,2020-03-10,Chicago,78,2020,3,1,5,Mike Johnson
3,4,Emily,Brown,30,80000.0,2020-04-05,Houston,95,2020,4,2,5,Emily Brown
5,6,Laura,Wilson,20,72000.0,2020-06-18,Philadelphia,90,2020,6,2,5,Laura Wilson
8,9,James,Anderson,40,58000.0,2020-09-25,San Jose,72,2020,9,3,5,James Anderson
10,11,William,Jackson,10,61000.0,2021-01-10,Seattle,83,2021,1,1,4,William Jackson
13,14,Ava,Martin,10,63000.0,2021-04-25,Atlanta,80,2021,4,2,4,Ava Martin
14,15,Daniel,Thompson,40,56000.0,2021-05-30,Boston,75,2021,5,2,4,Daniel Thompson
17,18,Charlotte,Robinson,20,76000.0,2021-08-25,Orlando,94,2021,8,3,4,Charlotte Robinson

In [24]:
namePatterns = emp['first_name'].isin(['Mike', 'Daniel', 'soya'])

In [25]:
emp[namePatterns]

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name
2,3,Mike,Johnson,10,65000.0,2020-03-10,Chicago,78,2020,3,1,5,Mike Johnson
14,15,Daniel,Thompson,40,56000.0,2021-05-30,Boston,75,2021,5,2,4,Daniel Thompson

In [26]:
# returns list either the condition is true or not
mask = emp['salary'].isna() | emp['city'].str.startswith('B')
emp.loc[mask,['Full Name', 'city', 'salary', 'performance_score']]

          Full Name      city   salary  performance_score
4       David Davis   Phoenix      NaN                 88
14  Daniel Thompson    Boston  56000.0                 75
15  Isabella Garcia  Portland      NaN                 93

# Sorting (ORDER BY vs sort_values)

----

In [27]:
emp.head(10)

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name
0,1,John,Doe,10,60000.0,2020-01-15,New York,85,2020,1,1,5,John Doe
1,2,Jane,Smith,20,75000.0,2020-02-20,Los Angeles,92,2020,2,1,5,Jane Smith
2,3,Mike,Johnson,10,65000.0,2020-03-10,Chicago,78,2020,3,1,5,Mike Johnson
3,4,Emily,Brown,30,80000.0,2020-04-05,Houston,95,2020,4,2,5,Emily Brown
4,5,David,Davis,40,NaN,2020-05-12,Phoenix,88,2020,5,2,5,David Davis
5,6,Laura,Wilson,20,72000.0,2020-06-18,Philadelphia,90,2020,6,2,5,Laura Wilson
6,7,Robert,Moore,30,85000.0,2020-07-22,San Antonio,79,2020,7,3,5,Robert Moore
7,8,Sophia,Taylor,10,62000.0,2020-08-30,Dallas,91,2020,8,3,5,Sophia Taylor
8,9,James,Anderson,40,58000.0,2020-09-25,San Jose,72,2020,9,3,5,James Anderson
9,10,Olivia,Thomas,20,78000.0,2020-10-15,Austin,96,2020,10,4,5,Olivia Thomas

In [28]:
# Ascending False = Descending
emp.sort_values(['salary', 'city'], ascending = [False, True])

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name
6,7,Robert,Moore,30,85000.0,2020-07-22,San Antonio,79,2020,7,3,5,Robert Moore
18,19,Joseph,Clark,30,83000.0,2021-09-30,Detroit,86,2021,9,3,4,Joseph Clark
11,12,Emma,White,30,82000.0,2021-02-15,Denver,89,2021,2,1,4,Emma White
3,4,Emily,Brown,30,80000.0,2020-04-05,Houston,95,2020,4,2,5,Emily Brown
9,10,Olivia,Thomas,20,78000.0,2020-10-15,Austin,96,2020,10,4,5,Olivia Thomas
17,18,Charlotte,Robinson,20,76000.0,2021-08-25,Orlando,94,2021,8,3,4,Charlotte Robinson
1,2,Jane,Smith,20,75000.0,2020-02-20,Los Angeles,92,2020,2,1,5,Jane Smith
12,13,Michael,Harris,20,74000.0,2021-03-20,Miami,87,2021,3,1,4,Michael Harris
5,6,Laura,Wilson,20,72000.0,2020-06-18,Philadelphia,90,2020,6,2,5,Laura Wilson
2,3,Mike,Johnson,10,65000.0,2020-03-10,Chicago,78,2020,3,1,5,Mike Johnson
16,17,Matthew,Martinez,10,64000.0,2021-07-20,Las Vegas,81,2021,7,3,4,Matthew Martinez
13,14,Ava,Martin,10,63000.0,2021-04-25,Atlanta,80,2021,4,2,4,Ava Martin
7,8,Sophia,Taylor,10,62000.0,2020-08-30,Dallas,91,2020,8,3,5,Sophia Taylor
10,11,William,Jackson,10,61000.0,2021-01-10,Seattle,83,2021,1,1,4,William Jackson
0,1,John,Doe,10,60000.0,2020-01-15,New York,85,2020,1,1,5,John Doe
19,20,John,Doe,10,60000.0,2022-01-15,New York,85,2022,1,1,3,John Doe
8,9,James,Anderson,40,58000.0,2020-09-25,San Jose,72,2020,9,3,5,James Anderson
14,15,Daniel,Thompson,40,56000.0,2021-05-30,Boston,75,2021,5,2,4,Daniel Thompson
4,5,David,Davis,40,NaN,2020-05-12,Phoenix,88,2020,5,2,5,David Davis
15,16,Isabella,Garcia,30,NaN,2021-06-15,Portland,93,2021,6,2,4,Isabella Garcia

In [29]:
emp.sort_values(['city'], ascending = [True]).head(5)

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name
13,14,Ava,Martin,10,63000.0,2021-04-25,Atlanta,80,2021,4,2,4,Ava Martin
9,10,Olivia,Thomas,20,78000.0,2020-10-15,Austin,96,2020,10,4,5,Olivia Thomas
14,15,Daniel,Thompson,40,56000.0,2021-05-30,Boston,75,2021,5,2,4,Daniel Thompson
2,3,Mike,Johnson,10,65000.0,2020-03-10,Chicago,78,2020,3,1,5,Mike Johnson
7,8,Sophia,Taylor,10,62000.0,2020-08-30,Dallas,91,2020,8,3,5,Sophia Taylor

In [30]:
performance_per_department = emp.sort_values(['department_id', 'performance_score', 'Full Name'], ascending = [True, False, True])
performance_per_department[['Full Name', 'department_id', 'performance_score', 'salary']].fillna('Not available')

             Full Name  department_id  performance_score         salary
7        Sophia Taylor             10                 91        62000.0
0             John Doe             10                 85        60000.0
19            John Doe             10                 85        60000.0
10     William Jackson             10                 83        61000.0
16    Matthew Martinez             10                 81        64000.0
13          Ava Martin             10                 80        63000.0
2         Mike Johnson             10                 78        65000.0
9        Olivia Thomas             20                 96        78000.0
17  Charlotte Robinson             20                 94        76000.0
1           Jane Smith             20                 92        75000.0
5         Laura Wilson             20                 90        72000.0
12      Michael Harris             20                 87        74000.0
3          Emily Brown             30                 95        80000.0
15     Isabella Garcia             30                 93  Not available
11          Emma White             30                 89        82000.0
18        Joseph Clark             30                 86        83000.0
6         Robert Moore             30                 79        85000.0
4          David Davis             40                 88  Not available
14     Daniel Thompson             40                 75        56000.0
8       James Anderson             40                 72        58000.0

# Aggregation Functions

----

In [31]:
emp['salary'].sum() # Total sum

np.float64(1254000.0)

In [32]:
emp['salary'].mean() # Average salary

np.float64(69666.66666666667)

In [33]:
emp['salary'].median() # Balance point

np.float64(68500.0)

# GROUP BY 
-----

In [34]:
# groupby modern and elegant

(emp.groupby(['department_id'])
    .agg(
        Total_salary = ('salary', 'sum'),
        Avg_salary = ('salary', 'mean')
    ).
    sort_values('Total_salary', ascending = False)
)

               Total_salary    Avg_salary
department_id
10                 435000.0  62142.857143
20                 375000.0  75000.000000
30                 330000.0  82500.000000
40                 114000.0  57000.000000

Avg salary per department
Number of employees per city
Total bonus per department (after join)
Highest salary per department
Number of hires per year (extract year from hire_date)
Average performance score per department, only departments with >4 people
Count of missing salaries per department
Median salary per department (Pandas .median(), SQL approximate with percentile)
Number of employees hired in each year-month
Top 1 highest paid employee per department (SQL uses ROW_NUMBER, Pandas nlargest)

In [35]:
# Avg salary per department
# Highest salary per department
# Median salary per department 

(emp.groupby(['department_id']).
    agg(
        avg_salary = ('salary', 'mean'),
        highest_salary = ('salary', 'max'),
        median_salary = ('salary', 'median')
    )
)

                 avg_salary  highest_salary  median_salary
department_id
10             62142.857143         65000.0        62000.0
20             75000.000000         78000.0        75000.0
30             82500.000000         85000.0        82500.0
40             57000.000000         58000.0        57000.0

In [36]:
# Number of employees per city
(emp.groupby(['city']).
    agg(
        total_employees = ('employee_id', 'count')
    ).
    sort_values('total_employees', ascending = False).
    head(5)
    )

             total_employees
city
New York                   2
Atlanta                    1
Miami                      1
San Jose                   1
San Antonio                1

In [37]:
# Number of hires per year (extract year from hire_date)
(emp.groupby(['hire_year']).
    agg(
        Total_hired_employees = ('hire_date', 'count')
        ).
    sort_values('Total_hired_employees', ascending = True)
    )

           Total_hired_employees
hire_year
2022                           1
2021                           9
2020                          10

In [38]:
emp[['employee_id', 'first_name', 'last_name', 'department_id', 'salary', 'hire_date', 'city', 'performance_score', 'hire_year','Full Name', 'experience_years']]

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,Full Name,experience_years
0,1,John,Doe,10,60000.0,2020-01-15,New York,85,2020,John Doe,5
1,2,Jane,Smith,20,75000.0,2020-02-20,Los Angeles,92,2020,Jane Smith,5
2,3,Mike,Johnson,10,65000.0,2020-03-10,Chicago,78,2020,Mike Johnson,5
3,4,Emily,Brown,30,80000.0,2020-04-05,Houston,95,2020,Emily Brown,5
4,5,David,Davis,40,NaN,2020-05-12,Phoenix,88,2020,David Davis,5
5,6,Laura,Wilson,20,72000.0,2020-06-18,Philadelphia,90,2020,Laura Wilson,5
6,7,Robert,Moore,30,85000.0,2020-07-22,San Antonio,79,2020,Robert Moore,5
7,8,Sophia,Taylor,10,62000.0,2020-08-30,Dallas,91,2020,Sophia Taylor,5
8,9,James,Anderson,40,58000.0,2020-09-25,San Jose,72,2020,James Anderson,5
9,10,Olivia,Thomas,20,78000.0,2020-10-15,Austin,96,2020,Olivia Thomas,5
10,11,William,Jackson,10,61000.0,2021-01-10,Seattle,83,2021,William Jackson,4
11,12,Emma,White,30,82000.0,2021-02-15,Denver,89,2021,Emma White,4
12,13,Michael,Harris,20,74000.0,2021-03-20,Miami,87,2021,Michael Harris,4
13,14,Ava,Martin,10,63000.0,2021-04-25,Atlanta,80,2021,Ava Martin,4
14,15,Daniel,Thompson,40,56000.0,2021-05-30,Boston,75,2021,Daniel Thompson,4
15,16,Isabella,Garcia,30,NaN,2021-06-15,Portland,93,2021,Isabella Garcia,4
16,17,Matthew,Martinez,10,64000.0,2021-07-20,Las Vegas,81,2021,Matthew Martinez,4
17,18,Charlotte,Robinson,20,76000.0,2021-08-25,Orlando,94,2021,Charlotte Robinson,4
18,19,Joseph,Clark,30,83000.0,2021-09-30,Detroit,86,2021,Joseph Clark,4
19,20,John,Doe,10,60000.0,2022-01-15,New York,85,2022,John Doe,3

In [39]:
# Count of missing salaries per department
missing = emp.groupby('department_id')['salary'].apply(lambda x: x.isna().sum())
print(missing)

department_id
10    0
20    0
30    1
40    1
Name: salary, dtype: int64

In [40]:
emp.groupby('department_id')['salary'].sum()

department_id
10    435000.0
20    375000.0
30    330000.0
40    114000.0
Name: salary, dtype: float64

# Joins / Merge 

----

In [41]:
# applying merge method to df emp
# merging with dept using 'department_id' 
# using left merge 
# here emp is the leading table all rows from it would be included while only matching rows from dept would be included

(emp.merge(dept, on='department_id', how='left')
     .merge(bonus, on = 'employee_id', how = 'left')
     .head(5)
    )

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name,department_name,location,budget,bonus_amount,bonus_date
0,1,John,Doe,10,60000.0,2020-01-15,New York,85,2020,1,1,5,John Doe,Sales,New York,500000,1970-01-01 00:00:00.000005,2023-01-01
1,2,Jane,Smith,20,75000.0,2020-02-20,Los Angeles,92,2020,2,1,5,Jane Smith,Marketing,Los Angeles,800000,1970-01-01 00:00:00.000008,2023-01-01
2,3,Mike,Johnson,10,65000.0,2020-03-10,Chicago,78,2020,3,1,5,Mike Johnson,Sales,New York,500000,NaT,NaN
3,4,Emily,Brown,30,80000.0,2020-04-05,Houston,95,2020,4,2,5,Emily Brown,IT,Chicago,1200000,1970-01-01 00:00:00.000010,2023-01-01
4,5,David,Davis,40,NaN,2020-05-12,Phoenix,88,2020,5,2,5,David Davis,HR,Houston,400000,NaT,NaN

In [54]:
emp[::].sample()

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name
14,15,Daniel,Thompson,40,56000.0,2021-05-30,Boston,75,2021,5,2,4,Daniel Thompson

In [53]:
dept[::].sample()

   department_id department_name     location  budget
1             20       Marketing  Los Angeles  800000

In [55]:
bonus[::].sample()

   employee_id                  bonus_amount  bonus_date
6           13 1970-01-01 00:00:00.000007500  2023-01-01

Employee + department name
Employee + bonus (left join  shows NULL/NaN for no bonus)
Only employees who received bonus (inner join)
All departments and their employees (right join on departments)
Full outer to see everything

In [52]:
# Employee + department name
(emp.merge(dept, on = 'department_id', how = 'inner'))[['employee_id', 'Full Name', 'department_id','department_name','budget']]

    employee_id           Full Name  department_id department_name   budget
0             1            John Doe             10           Sales   500000
1             2          Jane Smith             20       Marketing   800000
2             3        Mike Johnson             10           Sales   500000
3             4         Emily Brown             30              IT  1200000
4             5         David Davis             40              HR   400000
5             6        Laura Wilson             20       Marketing   800000
6             7        Robert Moore             30              IT  1200000
7             8       Sophia Taylor             10           Sales   500000
8             9      James Anderson             40              HR   400000
9            10       Olivia Thomas             20       Marketing   800000
10           11     William Jackson             10           Sales   500000
11           12          Emma White             30              IT  1200000
12           13      Michael Harris             20       Marketing   800000
13           14          Ava Martin             10           Sales   500000
14           15     Daniel Thompson             40              HR   400000
15           16     Isabella Garcia             30              IT  1200000
16           17    Matthew Martinez             10           Sales   500000
17           18  Charlotte Robinson             20       Marketing   800000
18           19        Joseph Clark             30              IT  1200000
19           20            John Doe             10           Sales   500000

In [58]:
# Employee + bonus (left join  shows NULL/NaN for no bonus)
emp.merge(bonus, on = 'employee_id', how = 'left')[['employee_id','Full Name', 'bonus_amount']]

    employee_id           Full Name                  bonus_amount
0             1            John Doe 1970-01-01 00:00:00.000005000
1             2          Jane Smith 1970-01-01 00:00:00.000008000
2             3        Mike Johnson                           NaT
3             4         Emily Brown 1970-01-01 00:00:00.000010000
4             5         David Davis                           NaT
5             6        Laura Wilson 1970-01-01 00:00:00.000007000
6             7        Robert Moore                           NaT
7             8       Sophia Taylor 1970-01-01 00:00:00.000006000
8             9      James Anderson                           NaT
9            10       Olivia Thomas                           NaT
10           11     William Jackson 1970-01-01 00:00:00.000005500
11           12          Emma White                           NaT
12           13      Michael Harris 1970-01-01 00:00:00.000007500
13           14          Ava Martin                           NaT
14           15     Daniel Thompson 1970-01-01 00:00:00.000004000
15           16     Isabella Garcia                           NaT
16           17    Matthew Martinez                           NaT
17           18  Charlotte Robinson 1970-01-01 00:00:00.000009000
18           19        Joseph Clark                           NaT
19           20            John Doe                           NaT

In [59]:
# employee who got bonus
emp.merge(bonus, on = 'employee_id', how = 'right')[['employee_id','Full Name', 'bonus_amount']]

   employee_id           Full Name                  bonus_amount
0            1            John Doe 1970-01-01 00:00:00.000005000
1            2          Jane Smith 1970-01-01 00:00:00.000008000
2            4         Emily Brown 1970-01-01 00:00:00.000010000
3            6        Laura Wilson 1970-01-01 00:00:00.000007000
4            8       Sophia Taylor 1970-01-01 00:00:00.000006000
5           11     William Jackson 1970-01-01 00:00:00.000005500
6           13      Michael Harris 1970-01-01 00:00:00.000007500
7           15     Daniel Thompson 1970-01-01 00:00:00.000004000
8           18  Charlotte Robinson 1970-01-01 00:00:00.000009000

In [60]:
# employee who are recoreded in employee table and go bonus
emp.merge(bonus, on = 'employee_id', how = 'inner')[['employee_id','Full Name', 'bonus_amount']]

   employee_id           Full Name                  bonus_amount
0            1            John Doe 1970-01-01 00:00:00.000005000
1            2          Jane Smith 1970-01-01 00:00:00.000008000
2            4         Emily Brown 1970-01-01 00:00:00.000010000
3            6        Laura Wilson 1970-01-01 00:00:00.000007000
4            8       Sophia Taylor 1970-01-01 00:00:00.000006000
5           11     William Jackson 1970-01-01 00:00:00.000005500
6           13      Michael Harris 1970-01-01 00:00:00.000007500
7           15     Daniel Thompson 1970-01-01 00:00:00.000004000
8           18  Charlotte Robinson 1970-01-01 00:00:00.000009000

In [66]:
# All departments and their employees (right join on departments)
(emp.merge(dept, on = "department_id", how = 'right').groupby('department_name')
    .agg(
    total_employees = ('employee_id', 'count')
        )
)

                 total_employees
department_name
HR                             3
IT                             5
Marketing                      5
Sales                          7

In [69]:
(emp.merge(dept, on = 'department_id', how = 'outer').
    merge(bonus, on = 'employee_id', how = 'outer')
)[['employee_id', 'Full Name', 'salary', 'performance_score', 'department_name', 'budget', 'bonus_amount']]

,employee_id,Full Name,salary,performance_score,department_name,budget,bonus_amount
0,1,John Doe,60000.0,85,Sales,500000,1970-01-01 00:00:00.000005000
1,2,Jane Smith,75000.0,92,Marketing,800000,1970-01-01 00:00:00.000008000
2,3,Mike Johnson,65000.0,78,Sales,500000,NaT
3,4,Emily Brown,80000.0,95,IT,1200000,1970-01-01 00:00:00.000010000
4,5,David Davis,NaN,88,HR,400000,NaT
5,6,Laura Wilson,72000.0,90,Marketing,800000,1970-01-01 00:00:00.000007000
6,7,Robert Moore,85000.0,79,IT,1200000,NaT
7,8,Sophia Taylor,62000.0,91,Sales,500000,1970-01-01 00:00:00.000006000
8,9,James Anderson,58000.0,72,HR,400000,NaT
9,10,Olivia Thomas,78000.0,96,Marketing,800000,NaT
10,11,William Jackson,61000.0,83,Sales,500000,1970-01-01 00:00:00.000005500
11,12,Emma White,82000.0,89,IT,1200000,NaT
12,13,Michael Harris,74000.0,87,Marketing,800000,1970-01-01 00:00:00.000007500
13,14,Ava Martin,63000.0,80,Sales,500000,NaT
14,15,Daniel Thompson,56000.0,75,HR,400000,1970-01-01 00:00:00.000004000
15,16,Isabella Garcia,NaN,93,IT,1200000,NaT
16,17,Matthew Martinez,64000.0,81,Sales,500000,NaT
17,18,Charlotte Robinson,76000.0,94,Marketing,800000,1970-01-01 00:00:00.000009000
18,19,Joseph Clark,83000.0,86,IT,1200000,NaT
19,20,John Doe,60000.0,85,Sales,500000,NaT

# Handling missing data
-----

In [70]:
# missing values in emp df
emp.isna().sum()

employee_id          0
first_name           0
last_name            0
department_id        0
salary               2
hire_date            0
city                 0
performance_score    0
hire_year            0
hire_month           0
hire_quarter         0
experience_years     0
Full Name            0
dtype: int64

In [74]:
emp[(emp['salary'].isna())][['employee_id', 'first_name', 'salary']]

    employee_id first_name  salary
4             5      David     NaN
15           16   Isabella     NaN

In [84]:
emp[['employee_id', 'first_name', 'salary']]

    employee_id first_name   salary
0             1       John  60000.0
1             2       Jane  75000.0
2             3       Mike  65000.0
3             4      Emily  80000.0
4             5      David      NaN
5             6      Laura  72000.0
6             7     Robert  85000.0
7             8     Sophia  62000.0
8             9      James  58000.0
9            10     Olivia  78000.0
10           11    William  61000.0
11           12       Emma  82000.0
12           13    Michael  74000.0
13           14        Ava  63000.0
14           15     Daniel  56000.0
15           16   Isabella      NaN
16           17    Matthew  64000.0
17           18  Charlotte  76000.0
18           19     Joseph  83000.0
19           20       John  60000.0

In [76]:
# Drops rows with missing salaries
emp.dropna(subset = ['salary'])[['employee_id', 'first_name', 'salary']]

    employee_id first_name   salary
0             1       John  60000.0
1             2       Jane  75000.0
2             3       Mike  65000.0
3             4      Emily  80000.0
5             6      Laura  72000.0
6             7     Robert  85000.0
7             8     Sophia  62000.0
8             9      James  58000.0
9            10     Olivia  78000.0
10           11    William  61000.0
11           12       Emma  82000.0
12           13    Michael  74000.0
13           14        Ava  63000.0
14           15     Daniel  56000.0
16           17    Matthew  64000.0
17           18  Charlotte  76000.0
18           19     Joseph  83000.0
19           20       John  60000.0

In [77]:
emp[(emp['salary'].isna())][['employee_id', 'first_name', 'salary']]

    employee_id first_name  salary
4             5      David     NaN
15           16   Isabella     NaN

In [78]:
emp.sample()

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name
19,20,John,Doe,10,60000.0,2022-01-15,New York,85,2022,1,1,3,John Doe

In [81]:
# Fill missing salary with department average
emp.groupby('department_id')['salary'].transform(lambda x : x.fillna(x.mean()))

0     60000.0
1     75000.0
2     65000.0
3     80000.0
4     57000.0
5     72000.0
6     85000.0
7     62000.0
8     58000.0
9     78000.0
10    61000.0
11    82000.0
12    74000.0
13    63000.0
14    56000.0
15    82500.0
16    64000.0
17    76000.0
18    83000.0
19    60000.0
Name: salary, dtype: float64

In [88]:
# Filling missing salary with 0
emp['salary'].fillna(0)

0     60000.0
1     75000.0
2     65000.0
3     80000.0
4         0.0
5     72000.0
6     85000.0
7     62000.0
8     58000.0
9     78000.0
10    61000.0
11    82000.0
12    74000.0
13    63000.0
14    56000.0
15        0.0
16    64000.0
17    76000.0
18    83000.0
19    60000.0
Name: salary, dtype: float64

# Pivot table

In [92]:
dept

   department_id department_name     location   budget
0             10           Sales     New York   500000
1             20       Marketing  Los Angeles   800000
2             30              IT      Chicago  1200000
3             40              HR      Houston   400000

In [89]:
emp.sample()

,employee_id,first_name,last_name,department_id,salary,hire_date,city,performance_score,hire_year,hire_month,hire_quarter,experience_years,Full Name
12,13,Michael,Harris,20,74000.0,2021-03-20,Miami,87,2021,3,1,4,Michael Harris

In [94]:
(emp.merge(dept, on = 'department_id', how = 'outer').pivot_table(
    values = 'performance_score',
    index = 'city',
    columns = 'department_name',
    aggfunc = 'mean',
    fill_value = 0
))

department_name    HR    IT  Marketing  Sales
city
Atlanta           0.0   0.0        0.0   80.0
Austin            0.0   0.0       96.0    0.0
Boston           75.0   0.0        0.0    0.0
Chicago           0.0   0.0        0.0   78.0
Dallas            0.0   0.0        0.0   91.0
Denver            0.0  89.0        0.0    0.0
Detroit           0.0  86.0        0.0    0.0
Houston           0.0  95.0        0.0    0.0
Las Vegas         0.0   0.0        0.0   81.0
Los Angeles       0.0   0.0       92.0    0.0
Miami             0.0   0.0       87.0    0.0
New York          0.0   0.0        0.0   85.0
Orlando           0.0   0.0       94.0    0.0
Philadelphia      0.0   0.0       90.0    0.0
Phoenix          88.0   0.0        0.0    0.0
Portland          0.0  93.0        0.0    0.0
San Antonio       0.0  79.0        0.0    0.0
San Jose         72.0   0.0        0.0    0.0
Seattle           0.0   0.0        0.0   83.0